app/controllers/budgets_controller.rb

  def index
    @budgets = current_user.budgets.for_this_month
    if @budgets.length == 0
      @budgets = Budget.create_current(current_user)
---
SELECT "budgets".* FROM "budgets" INNER JOIN "buckets" ON "budgets".bucket_id = "buckets".id WHERE (("buckets".user_id = 2)) AND ((budgets.valid_from >= '2010-04-01' AND budgets.valid_to <= '2010-04-30') AND (("buckets".user_id = 2)))
INSERT INTO "budgets" ("valid_to", "created_at", "bucket_id", "updated_at", "amount", "valid_from") VALUES('2010-04-30', '2010-04-10 12:51:29', 1, '2010-04-10 12:51:29', NULL, '2010-04-01')

  def show
    @budget = Budget.find(params[:id])
---
SELECT * FROM "budgets" WHERE ("budgets"."id" = 1)