app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "last_request_at", "crypted_password", "updated_at", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at") VALUES('2010-04-10 10:35:01', '2010-04-10 10:35:01', 'c44cfbef2b512b15a88a5a281b91b367782e147d104157764de4e7e3e27accbc7f44b9d898f4d17d81d73d5ffa1e081f3f87c5eb51e7eedd2b526dbc683e3655', '2010-04-10 10:35:01', '127.0.0.1', 'hGafSKdbNrJZ1BCH15rK', '2010-04-10 10:35:01', '134bf5abd2a2b22925d5f918227c901faf3deaa6f0906e4a04e6987fc5d3178eb6a6b11f579f11c4af4877bd3d48f376c4f6fb3d2bde80c5d89b86e308524a83', 1, NULL, 'medis', NULL)
---
  def create
    @user = User.new(params[:user])
    if @user.save